{
    "translation": {

        "about": "About",
        "work": "Work",

        "hiIm": "Hi, I'm",
        "IDevelop": "I develop user interfaces and web applications",

        "introduction": {
            "title": "Introduction",
            "overview": "Overview",
            "aboutP1": "Hi there! My name is Samuel Piasecki, and I'm a frontend developer based in Brazil. I graduated with a degree in computer science and have been passionate about programming ever since. With a strong focus on web development, I have gained extensive knowledge and experience working with various JavaScript frameworks and libraries.",
            "aboutP2": "Over the years, I have honed my skills in creating engaging and user-friendly web interfaces. From responsive designs to interactive components, I strive to deliver seamless experiences for users across different devices. I am well-versed in HTML, CSS, and JavaScript, and I keep up with the latest industry trends and best practices to ensure the highest quality of my work.",
            "aboutP3": "I am thrilled to continue my journey as a frontend developer, constantly learning and expanding my skills to create innovative and impactful digital experiences."
        },

       "experience": {
            "whatIHaveDone": "What I have done so far",
            "workExperience": "Work Experience",

            "internship": "Intership",
            "internshipDate": "November 2022 - April 2023",
            "internshipPoint1": "Developing and maintaining web applications using HTML, SASS, PHP and other related technologies.",
            "internshipPoint2": "Collaborating with cross-functional teams including designers, and other developers.",
            "internshipPoint3": "Implementing responsive design and ensuring cross-browser compatibility.",

            "developerBrsis": "Frontend Developer",
            "developerBrsisDate": "April 2023 - April 2024",
            "developerBrsisPoint1": "Developing and maintaining web applications using HTML, SASS, PHP and other related technologies.",
            "developerBrsisPoint2": "Collaborating with cross-functional teams including designers, and other developers.",
            "developerBrsisPoint3": "Implementing responsive design and ensuring cross-browser compatibility.",

            "developer3C": "Frontend Developer",
            "developer3CDate": "April 2024 - July 2024",
            "developer3CPoint1": "Developing an application using Vue.js and other related technologies.",
            "developer3CPoint2": "Collaborating with full teams, including UX designers, Backend Developers, QAs, among others.",
            "developer3CPoint3": "Collaborating in the development of an all-in-one solution tool, encompassing Automatic Dialer, SMS, WhatsApp, CRM, etc.",

            "developerPalinha": "Mobile Developer",
            "developerPalinhaDate": "August 2024 - October 2024",
            "developerPalinhaPoint1": "Developing an application using Flutter and other related technologies.",
            "developerPalinhaPoint2": "Collaborating on a project that connects independent musicians with contractors.",

            "developerCoamo": "Systems Analyst",
            "developerCoamoDate": "February 2025 - Present",
            "developerCoamoPoint": "I act as a bridge between business and technology, mapping processes, gathering requirements, and developing solutions that meet the cooperative's demands. Using agile methodologies, I optimize the development, deployment, and maintenance of systems, ensuring integration and continuous process improvement."
       },

        "projects": {
            "myWork": "My work",
            "projects": "Projects",
            "inThisSection": "In this section, I want to show you some of the projects that I developed focusing on learning and improving my skills.",

            "notionaryDescription": "This Project was created to develop more advanced skills with Vue.js. The following tools were used in Notionary: Vue.js, Firebase, Bulma, Vue-router, Pinia and Compositions APIs.",
            "apoloDescription": "The objective of this project is to learn how to build React applications and develop skills to work with front-end. In this project, you will see a landing page to organize characters/items in their roles. You can organize them into: Enemies; Characters; Items; Scenarios; Extras.",
            "agnoliniDescription": "Welcome to the Angolini Restaurant Menu project! This project is a web application built with React, TypeScript, ESLint, SCSS, and React Router DOM. It aims to showcase a menu for a restaurant that specializes in serving delicious pastas.",
            "talesOfTaleDescription": "This mobile game was created as my Final Paper for my graduation. I created this project with a friend, and I created all the interfaces of the game. This includes: UX, sprites, and soundtrack.",
            "studyClockDescription": "Study Clock is a simple application built with React and TypeScript that helps you manage your study sessions. With Study Clock, you can set a timer for a specific amount of time.",
            "timelineDescription": "Project with Next.js developed during a course in Alura, where the idea was to develop a 'Blog' about my progress in my careear. In this project was used: Next.js, React, Typescript, CSS-in-Js, Context API, amoung others techs.",
            "crudDescription": "This is a website project that allows users to interact with a database powered by Supabase using Create, Read, Update, and Delete (CRUD) operations. The website is built using TypeScript, Next.js, React, and Supabase. It also includes Continuous Integration and Continuous Deployment (CI/CD) with GitHub Actions and end-to-end testing using Cypress."
        },

        "contact": {
            "getInTouch": "get in touch",
            "title": "Contact",
            "name": "Your Name",
            "namePlaceholder": "What's your name?",
            "email": "Your Email",
            "emailPlaceholder": "What's your email?",
            "message": "Your Message",
            "messagePlaceholder": "Let your message here.",
            "send": "Send",
            "sending": "Sending",
            "emailSuccess": "Thank you, I will get back to you as soon as possible."
        },

        "tooltips": {
           "githubRepoLink": "Click here to access this Repository" 
        }
    }
}